BaseConfiguration/Money_2_0/DataProcessors/МониторСинхронизацииСМобильнымиУстройствами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>МониторСинхронизацииСМобильнымиУстройствами</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

BaseConfiguration/Money_2_0/Enums/ТипыПровайдеровREST.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПровайдеровREST</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Яндекс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Dropbox</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Google</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/ТранспортыОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ТранспортыОбменаДанными</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаСообщенийОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭлементовВТранзакцииВыгрузкиДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭлементовВТранзакцииЗагрузкиДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СжиматьФайлИсходящегоСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольАрхиваСообщенияОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйДопустимыйРазмерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяНаРесурсе</Name>
					<Comment>Имя пользователя (логин) на внешнем ресурсе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяНаРесурсе</Name>
					<Comment>Пароль пользователя на внешнем ресурсе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапомнитьПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMAILУчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользование</Name>
					<Comment>Запретить использование транспорта</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыТранспорта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДлиннойСтрокой</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/DataProcessors/МониторСинхронизацииСМобильнымиУстройствами/Forms/ИнтерактивныйОбменЧерезСервис/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
//Обработка.МониторСинхронизации.Форма.ИнтерактивныйОбменЧерезОблако
//  Выполняет фоновый обмен через облако и информирует пользователя о его состоянии
//  
//Параметры формы:
//  Стандартные параметры формы
//  
////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Перем ЗакрытиеОбработано;



#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыСпискаУстройств();
	
	ПередНачаломСинхронизации();
	
	Если ПараметрыОблака.ЗапретитьИспользование Тогда
		ДействиеПриОткрытии = "Открыть настройки";
	ИначеЕсли Не ПровайдерАвторизован(Истина) Тогда
		ДействиеПриОткрытии = "Открыть авторизацию";
	Иначе
		ДействиеПриОткрытии = "Начать синхронизацию";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ДействиеПриОткрытии = "Открыть настройки" Тогда
		ОткрытьФормуНастроек();
	ИначеЕсли ДействиеПриОткрытии = "Открыть авторизацию" Тогда
		ОткрытьФормуАвторизации();
	ИначеЕсли ДействиеПриОткрытии = "Начать синхронизацию" Тогда 
		ПодключитьОбработчикОжидания("Подключаемый_НачатьСинхронизациюКлиент", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗакрытиеОбработано <> Истина И ФоновоеЗаданиеЗавершено() = Ложь Тогда
		
		Отказ = истина;
		ПодтвердитьПрекращениеСинхронизации(Истина);
		
	КонецЕсли; 
	
КонецПроцедуры



#КонецОбласти



#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы

&НаКлиенте
Процедура СписокУстройствВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуУстройства(Элемент.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СписокУстройствПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	ПоказатьПредупреждение(, НСтр("ru='Добавление мобильных устройств происходит автоматически при первом получении данных от нового устройства'") );
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Повторить(Команда)
	
	ПередНачаломСинхронизации();
	
	НачатьСинхронизациюКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьИнформациюСервер();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПередНачаломСинхронизации()
	
	ОбновитьОтображениеСостояния("Подготовка");
	
	ОбновитьПараметрыПровайдера();
	
	ТекстОшибкиТранспорта = "";
	ОбновитьИнформациюСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюСервер()
	
	ОбновитьСостояниеПроцессов();
	Элементы.СписокУстройств.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеПроцессов()
	
	Обработки.МониторСинхронизацииСМобильнымиУстройствами.ОбновитьСостояниеПрцессаНаФорме(ЭтотОбъект, ИДФоновогоЗадания);
	
КонецПроцедуры
 

&НаСервере
Процедура ОбновитьПараметрыПровайдера()

	СвойстваАккаунта = Неопределено;
	Провайдер = RESTСлужебныйВызовСервера.ПровайдерИзПараметраСеанса(СвойстваАккаунта);
	Транспорт = Справочники.ТранспортыОбменаДанными.ОсновнойТранспортОблачногоПровайдера(Провайдер);
	ПараметрыОблака = Справочники.ТранспортыОбменаДанными.СтруктураПараметровТранспорта(Транспорт, Истина);
	ПараметрыОблака.Вставить("СвойстваАккаунта", СвойстваАккаунта);
	ВидТранспорта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Транспорт, "ВидТранспорта");
	
	Если Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Dropbox") Тогда
		Элементы.ИконкаПровайдера.Картинка = БиблиотекаКартинок.СинхронизацияDropBox16;
	ИначеЕсли Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Google") Тогда
		Элементы.ИконкаПровайдера.Картинка = БиблиотекаКартинок.СинхронизацияGoogleDrive16;
	ИначеЕсли Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Яндекс") Тогда
		Элементы.ИконкаПровайдера.Картинка = БиблиотекаКартинок.СинхронизацияЯндексДиск16;
	Иначе
		Элементы.ИконкаПровайдера.Картинка = БиблиотекаКартинок.Синхронизация16;
	КонецЕсли;
	
	Если ПараметрыОблака.ЗапретитьИспользование Тогда
		Элементы.ПредставлениеАккаунта.Заголовок = НСтр("ru='Отключен'");
	Иначе
		 Элементы.ПредставлениеАккаунта.Заголовок = СвойстваАккаунта.ПредставлениеАккаунта;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПровайдерАвторизован(ПроверятьНаСервере)

	СвойстваАккаунта = ?(ПараметрыОблака = Неопределено, Неопределено, ПараметрыОблака.СвойстваАккаунта);
	Возврат RESTВызовСервера.ПриложениеАвторизовано(Провайдер, ПроверятьНаСервере, СвойстваАккаунта);

КонецФункции

&НаКлиенте
Процедура ОткрытьФормуНастроек()

	// Параметры открываемой формы
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Провайдер", Провайдер);
	ПараметрыФормы.Вставить("ВключитьИспользованиеПриОткрытии", Истина);
	
	// Обработчик оповещения о закрытии формы
	ДополнительныеПараметры = Новый Структура();
	Оповещение = Новый ОписаниеОповещения("НастройкиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	// Открытие формы
	ОткрытьФорму("Обработка.МониторСинхронизацииСМобильнымиУстройствами.Форма.НастройкаОблачногоСервиса", ПараметрыФормы, ЭтотОбъект, Истина, , , Оповещение, РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуАвторизации()

	// Обработчик оповещения о закрытии формы
	ДополнительныеПараметры = Новый Структура();
	Оповещение = Новый ОписаниеОповещения("НастройкиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	RESTКлиент.ОткрытьФормуАвторизации(Провайдер, Оповещение); 

КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт

	РезультатИзменения = РезультатИзмененияНастроек();
	Если РезультатИзменения = "Запрет использования" Тогда
		
		Оповещение = Новый ОписаниеОповещения("ЗакрытиеПослеПредупреждения", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, НСтр("ru='Использование облачного сервиса запрещено в настройках.
				|Измените настройки и повторите попытку'"), , Заголовок);
		
	ИначеЕсли РезультатИзменения = "Не авторизован" Тогда
		
		Оповещение = Новый ОписаниеОповещения("ЗакрытиеПослеПредупреждения", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, НСтр("ru='Использование облачного сервиса запрещено в настройках.
				|Измените настройки и повторите попытку'"), , Заголовок);
		
	Иначе
		
		НачатьСинхронизациюКлиент();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция РезультатИзмененияНастроек()

	ОбновитьПараметрыПровайдера();
	Если ПараметрыОблака.ЗапретитьИспользование Тогда
		Возврат "Запрет использования";
	КонецЕсли;
	
	Если Не ПровайдерАвторизован(Ложь) Тогда
		Возврат "Не авторизован";
	КонецЕсли;

	Возврат "Ок";
	
КонецФункции

&НаКлиенте
Процедура ЗакрытиеПослеПредупреждения(ДополнительныеПараметры) Экспорт

	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НачатьСинхронизациюКлиент()

	НачатьСинхронизациюКлиент();

КонецПроцедуры

&НаКлиенте
Процедура НачатьСинхронизациюКлиент()
	
	ПроверкаПровайдераПередСинхронизацией();
	ДлительнаяОперация = НачатьСинхронизациюСервер();
	Элементы.СписокУстройств.Обновить();
	
	ОтключитьОбработчикОжидания("ОбработчикПроверкиСостоянияОбмена");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("Подключаемый_ОбработатьРезультатФоновогоОбмена", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьСообщения    = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОЗавершении;
	
	ДлительнаяОперация.Вставить("ИдентификаторЗадания", 
			Новый УникальныйИдентификатор(ДлительнаяОперация.ИдентификаторФоновогоЗадания));
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеСостояния(Статус)
	
	Элементы.ГруппаТекущееСостояние.Видимость = Ложь;;
	Элементы.ГруппаРамкаОшибки.Видимость      = Ложь;
	
	Если Статус = "Подготовка" Тогда
		Элементы.КартинкаСостояния.Картинка         = БиблиотекаКартинок.СинхронизацияНетОбмена48;
		Элементы.ТекстСостоянияТранспорта.Заголовок = НСтр("ru='Подготовка к обмену файлами…'");
		Элементы.Повторить.Доступность = Ложь;
	
	ИначеЕсли Статус = "Выполняется" Тогда
		Элементы.КартинкаСостояния.Картинка = БиблиотекаКартинок.СинхронизацияИдетОбмен48;
		Элементы.ТекстСостоянияТранспорта.Заголовок = НСтр("ru='Выполняется обмен файлами…'"); 
		Элементы.Повторить.Доступность = Ложь;
	
	ИначеЕсли Статус = "Завершено" Тогда
		Элементы.ТекстСостоянияТранспорта.Заголовок = НСтр("ru='Обмен файлами завершен'"); 
		Элементы.КартинкаСостояния.Картинка = ?(ЗначениеЗаполнено(ТекстОшибкиТранспорта), БиблиотекаКартинок.СинхронизацияОшибка48, БиблиотекаКартинок.СинхронизацияНетОбмена48);
		Элементы.Повторить.Доступность = Истина;
		Элементы.ГруппаРамкаОшибки.Видимость        = ЗначениеЗаполнено(ТекстОшибкиТранспорта);
		Если Не ЗначениеЗаполнено(ТекстОшибкиТранспорта) Тогда
			Элементы.ГруппаТекущееСостояние.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция НачатьСинхронизациюСервер()
	
	Если АвтоматОбменаФайлами.ФоновоеЗаданиеОбмена(Истина) <> Неопределено Тогда
		ВызватьИсключение НСтр("ru='Обмен уже выполняется в фоновом задании. Новый обмен запустить невозможно'");
	КонецЕсли;
	
	СостояниеОбмена = АвтоматОбменаФайлами.СостояниеОбмена(ВидТранспорта);
	Если СостояниеОбмена.ПроцессЗавершен Тогда
		АвтоматОбменаФайлами.СброситьСостояние(СостояниеОбмена);
	КонецЕсли;
	
	// Установим оформление формы
	ОбновитьОтображениеСостояния("Выполняется");
	
	РезультатВыполнения = АвтоматОбменаФайлами.ОбменСОблачнымХранилищемВручную(ВидТранспорта, ЭтотОбъект);
	
	ОбновитьИнформациюСервер();

	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ОбработатьРезультатФоновогоОбмена(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьИнформациюСервер();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтатусЗадания = "Завершено";
	Если Результат.Статус = "Выполнено" Тогда
		ТекстОшибкиТранспорта = "";
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат, "КраткоеПредставлениеОшибки") Тогда
			ТекстОшибкиТранспорта = Результат.КраткоеПредставлениеОшибки;
		Иначе
			ТекстОшибкиТранспорта = НСтр("ru='При выполнении обмена произошла какая-то ошибка'");
		КонецЕсли;
	Иначе
		СтатусЗадания = "Выполняется";
		ТекстОшибкиТранспорта = "";
	КонецЕсли;
	ОбновитьОтображениеСостояния(СтатусЗадания);
	
	Если СтатусЗадания = "Завершено" Тогда
		Оповестить("ВыполненОбменДанными");
	КонецЕсли;
	ПроверитьОбработчикОповещенияОбИзмененииСостояния();
	
	ИДФоновогоЗадания = Неопределено;
	
КонецПроцедуры

&НаСервере
Функция ФоновоеЗаданиеЗавершено()

	Если Не ЗначениеЗаполнено(ИДФоновогоЗадания) Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Попытка
		ЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(ИДФоновогоЗадания);
	Исключение
		
		ИДФоновогоЗадания = Неопределено;
		ЗаданиеВыполнено = Истина;
		
	КонецПопытки; 
	
	Возврат ЗаданиеВыполнено;
	
КонецФункции


&НаКлиенте
Процедура ПодтвердитьПрекращениеСинхронизации(ЗакрыватьФорму)

	ТекстВопроса = НСтр("ru = 'В данный момент выполняется обмен.
	|Прекратить его?'");
	Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект, Новый Структура("ЗакрыватьФорму", ЗакрыватьФорму));
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет );

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ПрекратитьСинхронизациюСервер();
		
		Если ДополнительныеПараметры.ЗакрыватьФорму Тогда
			ЗакрытиеОбработано = Истина;
			Закрыть();
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ПрекратитьСинхронизациюСервер()

	Если ЗначениеЗаполнено(ИДФоновогоЗадания) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИДФоновогоЗадания);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПровайдераПередСинхронизацией()

	Если Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Google") Тогда
		Если Не ПровайдерАвторизован(Истина) Тогда
			ОткрытьФормуАвторизации();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуУстройства(Устройство)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Устройство);
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуУстройстваЗавершение", ЭтотОбъект, Устройство);
	ОткрытьФорму("ПланОбмена.МобильноеПриложение.Форма.ПросмотрУзла", ПараметрыФормы, , , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуУстройстваЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	ОбновитьИнформациюСервер();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСпискаУстройств()
	
	СписокУстройств.Параметры.УстановитьЗначениеПараметра ("Активность", Истина);
	
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	СписокУстройств.Параметры.УстановитьЗначениеПараметра ("КодУспеха", ВсеКоды.Выполнено.Код);
	
	КодыОшибок = Новый Массив;
	Для Каждого ЭлементКода Из ВсеКоды Цикл
		Если ЭлементКода.Значение.ЯвляетсяОшибкой Тогда
			КодыОшибок.Добавить(ЭлементКода.Значение.Код);
		КонецЕсли;
	КонецЦикла;
	СписокУстройств.Параметры.УстановитьЗначениеПараметра ("КодыОшибок", КодыОшибок);
	
КонецПроцедуры


#КонецОбласти
